tests/performance/results/TASK-007/05-stress-warm.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /perf/workload.js
        output: -

     scenarios: (100.00%) 1 scenario, 25 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 25 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 25/25 VUs, 45 complete and 0 interrupted iterations
default   [   1% ] 25 VUs  0m01.0s/2m0s

running (0m02.0s), 25/25 VUs, 123 complete and 0 interrupted iterations
default   [   2% ] 25 VUs  0m02.0s/2m0s

running (0m03.0s), 25/25 VUs, 199 complete and 0 interrupted iterations
default   [   2% ] 25 VUs  0m03.0s/2m0s

running (0m04.0s), 25/25 VUs, 278 complete and 0 interrupted iterations
default   [   3% ] 25 VUs  0m04.0s/2m0s

running (0m05.0s), 25/25 VUs, 355 complete and 0 interrupted iterations
default   [   4% ] 25 VUs  0m05.0s/2m0s

running (0m06.0s), 25/25 VUs, 430 complete and 0 interrupted iterations
default   [   5% ] 25 VUs  0m06.0s/2m0s

running (0m07.0s), 25/25 VUs, 511 complete and 0 interrupted iterations
default   [   6% ] 25 VUs  0m07.0s/2m0s

running (0m08.0s), 25/25 VUs, 588 complete and 0 interrupted iterations
default   [   7% ] 25 VUs  0m08.0s/2m0s

running (0m09.0s), 25/25 VUs, 672 complete and 0 interrupted iterations
default   [   7% ] 25 VUs  0m09.0s/2m0s

running (0m10.0s), 25/25 VUs, 753 complete and 0 interrupted iterations
default   [   8% ] 25 VUs  0m10.0s/2m0s

running (0m11.0s), 25/25 VUs, 838 complete and 0 interrupted iterations
default   [   9% ] 25 VUs  0m11.0s/2m0s

running (0m12.0s), 25/25 VUs, 910 complete and 0 interrupted iterations
default   [  10% ] 25 VUs  0m12.0s/2m0s

running (0m13.0s), 25/25 VUs, 990 complete and 0 interrupted iterations
default   [  11% ] 25 VUs  0m13.0s/2m0s

running (0m14.0s), 25/25 VUs, 1068 complete and 0 interrupted iterations
default   [  12% ] 25 VUs  0m14.0s/2m0s

running (0m15.0s), 25/25 VUs, 1144 complete and 0 interrupted iterations
default   [  12% ] 25 VUs  0m15.0s/2m0s

running (0m16.0s), 25/25 VUs, 1229 complete and 0 interrupted iterations
default   [  13% ] 25 VUs  0m16.0s/2m0s

running (0m17.0s), 25/25 VUs, 1305 complete and 0 interrupted iterations
default   [  14% ] 25 VUs  0m17.0s/2m0s

running (0m18.0s), 25/25 VUs, 1384 complete and 0 interrupted iterations
default   [  15% ] 25 VUs  0m18.0s/2m0s

running (0m19.0s), 25/25 VUs, 1464 complete and 0 interrupted iterations
default   [  16% ] 25 VUs  0m19.0s/2m0s

running (0m20.0s), 25/25 VUs, 1547 complete and 0 interrupted iterations
default   [  17% ] 25 VUs  0m20.0s/2m0s

running (0m21.0s), 25/25 VUs, 1629 complete and 0 interrupted iterations
default   [  17% ] 25 VUs  0m21.0s/2m0s

running (0m22.0s), 25/25 VUs, 1708 complete and 0 interrupted iterations
default   [  18% ] 25 VUs  0m22.0s/2m0s

running (0m23.0s), 25/25 VUs, 1789 complete and 0 interrupted iterations
default   [  19% ] 25 VUs  0m23.0s/2m0s

running (0m24.0s), 25/25 VUs, 1869 complete and 0 interrupted iterations
default   [  20% ] 25 VUs  0m24.0s/2m0s

running (0m25.0s), 25/25 VUs, 1950 complete and 0 interrupted iterations
default   [  21% ] 25 VUs  0m25.0s/2m0s

running (0m26.0s), 25/25 VUs, 2031 complete and 0 interrupted iterations
default   [  22% ] 25 VUs  0m26.0s/2m0s

running (0m27.0s), 25/25 VUs, 2112 complete and 0 interrupted iterations
default   [  22% ] 25 VUs  0m27.0s/2m0s

running (0m28.0s), 25/25 VUs, 2188 complete and 0 interrupted iterations
default   [  23% ] 25 VUs  0m28.0s/2m0s

running (0m29.0s), 25/25 VUs, 2262 complete and 0 interrupted iterations
default   [  24% ] 25 VUs  0m29.0s/2m0s

running (0m30.0s), 25/25 VUs, 2345 complete and 0 interrupted iterations
default   [  25% ] 25 VUs  0m30.0s/2m0s

running (0m31.0s), 25/25 VUs, 2430 complete and 0 interrupted iterations
default   [  26% ] 25 VUs  0m31.0s/2m0s

running (0m32.0s), 25/25 VUs, 2511 complete and 0 interrupted iterations
default   [  27% ] 25 VUs  0m32.0s/2m0s

running (0m33.0s), 25/25 VUs, 2590 complete and 0 interrupted iterations
default   [  27% ] 25 VUs  0m33.0s/2m0s

running (0m34.0s), 25/25 VUs, 2667 complete and 0 interrupted iterations
default   [  28% ] 25 VUs  0m34.0s/2m0s

running (0m35.0s), 25/25 VUs, 2753 complete and 0 interrupted iterations
default   [  29% ] 25 VUs  0m35.0s/2m0s

running (0m36.0s), 25/25 VUs, 2832 complete and 0 interrupted iterations
default   [  30% ] 25 VUs  0m36.0s/2m0s

running (0m37.0s), 25/25 VUs, 2913 complete and 0 interrupted iterations
default   [  31% ] 25 VUs  0m37.0s/2m0s

running (0m38.0s), 25/25 VUs, 2993 complete and 0 interrupted iterations
default   [  32% ] 25 VUs  0m38.0s/2m0s

running (0m39.0s), 25/25 VUs, 3077 complete and 0 interrupted iterations
default   [  32% ] 25 VUs  0m39.0s/2m0s

running (0m40.0s), 25/25 VUs, 3155 complete and 0 interrupted iterations
default   [  33% ] 25 VUs  0m40.0s/2m0s

running (0m41.0s), 25/25 VUs, 3239 complete and 0 interrupted iterations
default   [  34% ] 25 VUs  0m41.0s/2m0s

running (0m42.0s), 25/25 VUs, 3316 complete and 0 interrupted iterations
default   [  35% ] 25 VUs  0m42.0s/2m0s

running (0m43.0s), 25/25 VUs, 3395 complete and 0 interrupted iterations
default   [  36% ] 25 VUs  0m43.0s/2m0s

running (0m44.0s), 25/25 VUs, 3473 complete and 0 interrupted iterations
default   [  37% ] 25 VUs  0m44.0s/2m0s

running (0m45.0s), 25/25 VUs, 3557 complete and 0 interrupted iterations
default   [  37% ] 25 VUs  0m45.0s/2m0s

running (0m46.0s), 25/25 VUs, 3640 complete and 0 interrupted iterations
default   [  38% ] 25 VUs  0m46.0s/2m0s

running (0m47.0s), 25/25 VUs, 3727 complete and 0 interrupted iterations
default   [  39% ] 25 VUs  0m47.0s/2m0s

running (0m48.0s), 25/25 VUs, 3809 complete and 0 interrupted iterations
default   [  40% ] 25 VUs  0m48.0s/2m0s

running (0m49.0s), 25/25 VUs, 3888 complete and 0 interrupted iterations
default   [  41% ] 25 VUs  0m49.0s/2m0s

running (0m50.0s), 25/25 VUs, 3966 complete and 0 interrupted iterations
default   [  42% ] 25 VUs  0m50.0s/2m0s

running (0m51.0s), 25/25 VUs, 4044 complete and 0 interrupted iterations
default   [  42% ] 25 VUs  0m51.0s/2m0s

running (0m52.0s), 25/25 VUs, 4128 complete and 0 interrupted iterations
default   [  43% ] 25 VUs  0m52.0s/2m0s

running (0m53.0s), 25/25 VUs, 4208 complete and 0 interrupted iterations
default   [  44% ] 25 VUs  0m53.0s/2m0s

running (0m54.0s), 25/25 VUs, 4292 complete and 0 interrupted iterations
default   [  45% ] 25 VUs  0m54.0s/2m0s

running (0m55.0s), 25/25 VUs, 4371 complete and 0 interrupted iterations
default   [  46% ] 25 VUs  0m55.0s/2m0s

running (0m56.0s), 25/25 VUs, 4452 complete and 0 interrupted iterations
default   [  47% ] 25 VUs  0m56.0s/2m0s

running (0m57.0s), 25/25 VUs, 4535 complete and 0 interrupted iterations
default   [  47% ] 25 VUs  0m57.0s/2m0s

running (0m58.0s), 25/25 VUs, 4618 complete and 0 interrupted iterations
default   [  48% ] 25 VUs  0m58.0s/2m0s

running (0m59.0s), 25/25 VUs, 4695 complete and 0 interrupted iterations
default   [  49% ] 25 VUs  0m59.0s/2m0s

running (1m00.0s), 25/25 VUs, 4780 complete and 0 interrupted iterations
default   [  50% ] 25 VUs  1m00.0s/2m0s

running (1m01.0s), 25/25 VUs, 4863 complete and 0 interrupted iterations
default   [  51% ] 25 VUs  1m01.0s/2m0s

running (1m02.0s), 25/25 VUs, 4943 complete and 0 interrupted iterations
default   [  52% ] 25 VUs  1m02.0s/2m0s

running (1m03.0s), 25/25 VUs, 5026 complete and 0 interrupted iterations
default   [  52% ] 25 VUs  1m03.0s/2m0s

running (1m04.0s), 25/25 VUs, 5106 complete and 0 interrupted iterations
default   [  53% ] 25 VUs  1m04.0s/2m0s

running (1m05.0s), 25/25 VUs, 5183 complete and 0 interrupted iterations
default   [  54% ] 25 VUs  1m05.0s/2m0s

running (1m06.0s), 25/25 VUs, 5266 complete and 0 interrupted iterations
default   [  55% ] 25 VUs  1m06.0s/2m0s

running (1m07.0s), 25/25 VUs, 5343 complete and 0 interrupted iterations
default   [  56% ] 25 VUs  1m07.0s/2m0s

running (1m08.0s), 25/25 VUs, 5424 complete and 0 interrupted iterations
default   [  57% ] 25 VUs  1m08.0s/2m0s

running (1m09.0s), 25/25 VUs, 5495 complete and 0 interrupted iterations
default   [  57% ] 25 VUs  1m09.0s/2m0s

running (1m10.0s), 25/25 VUs, 5580 complete and 0 interrupted iterations
default   [  58% ] 25 VUs  1m10.0s/2m0s

running (1m11.0s), 25/25 VUs, 5663 complete and 0 interrupted iterations
default   [  59% ] 25 VUs  1m11.0s/2m0s

running (1m12.0s), 25/25 VUs, 5743 complete and 0 interrupted iterations
default   [  60% ] 25 VUs  1m12.0s/2m0s

running (1m13.0s), 25/25 VUs, 5820 complete and 0 interrupted iterations
default   [  61% ] 25 VUs  1m13.0s/2m0s

running (1m14.0s), 25/25 VUs, 5898 complete and 0 interrupted iterations
default   [  62% ] 25 VUs  1m14.0s/2m0s

running (1m15.0s), 25/25 VUs, 5982 complete and 0 interrupted iterations
default   [  62% ] 25 VUs  1m15.0s/2m0s

running (1m16.0s), 25/25 VUs, 6068 complete and 0 interrupted iterations
default   [  63% ] 25 VUs  1m16.0s/2m0s

running (1m17.0s), 25/25 VUs, 6149 complete and 0 interrupted iterations
default   [  64% ] 25 VUs  1m17.0s/2m0s

running (1m18.0s), 25/25 VUs, 6231 complete and 0 interrupted iterations
default   [  65% ] 25 VUs  1m18.0s/2m0s

running (1m19.0s), 25/25 VUs, 6310 complete and 0 interrupted iterations
default   [  66% ] 25 VUs  1m19.0s/2m0s

running (1m20.0s), 25/25 VUs, 6384 complete and 0 interrupted iterations
default   [  67% ] 25 VUs  1m20.0s/2m0s

running (1m21.0s), 25/25 VUs, 6463 complete and 0 interrupted iterations
default   [  67% ] 25 VUs  1m21.0s/2m0s

running (1m22.0s), 25/25 VUs, 6544 complete and 0 interrupted iterations
default   [  68% ] 25 VUs  1m22.0s/2m0s

running (1m23.0s), 25/25 VUs, 6627 complete and 0 interrupted iterations
default   [  69% ] 25 VUs  1m23.0s/2m0s

running (1m24.0s), 25/25 VUs, 6713 complete and 0 interrupted iterations
default   [  70% ] 25 VUs  1m24.0s/2m0s

running (1m25.0s), 25/25 VUs, 6787 complete and 0 interrupted iterations
default   [  71% ] 25 VUs  1m25.0s/2m0s

running (1m26.0s), 25/25 VUs, 6858 complete and 0 interrupted iterations
default   [  72% ] 25 VUs  1m26.0s/2m0s

running (1m27.0s), 25/25 VUs, 6947 complete and 0 interrupted iterations
default   [  72% ] 25 VUs  1m27.0s/2m0s

running (1m28.0s), 25/25 VUs, 7025 complete and 0 interrupted iterations
default   [  73% ] 25 VUs  1m28.0s/2m0s

running (1m29.0s), 25/25 VUs, 7106 complete and 0 interrupted iterations
default   [  74% ] 25 VUs  1m29.0s/2m0s

running (1m30.0s), 25/25 VUs, 7183 complete and 0 interrupted iterations
default   [  75% ] 25 VUs  1m30.0s/2m0s

running (1m31.0s), 25/25 VUs, 7266 complete and 0 interrupted iterations
default   [  76% ] 25 VUs  1m31.0s/2m0s

running (1m32.0s), 25/25 VUs, 7352 complete and 0 interrupted iterations
default   [  77% ] 25 VUs  1m32.0s/2m0s

running (1m33.0s), 25/25 VUs, 7427 complete and 0 interrupted iterations
default   [  77% ] 25 VUs  1m33.0s/2m0s

running (1m34.0s), 25/25 VUs, 7508 complete and 0 interrupted iterations
default   [  78% ] 25 VUs  1m34.0s/2m0s

running (1m35.0s), 25/25 VUs, 7589 complete and 0 interrupted iterations
default   [  79% ] 25 VUs  1m35.0s/2m0s

running (1m36.0s), 25/25 VUs, 7670 complete and 0 interrupted iterations
default   [  80% ] 25 VUs  1m36.0s/2m0s

running (1m37.0s), 25/25 VUs, 7745 complete and 0 interrupted iterations
default   [  81% ] 25 VUs  1m37.0s/2m0s

running (1m38.0s), 25/25 VUs, 7834 complete and 0 interrupted iterations
default   [  82% ] 25 VUs  1m38.0s/2m0s

running (1m39.0s), 25/25 VUs, 7913 complete and 0 interrupted iterations
default   [  82% ] 25 VUs  1m39.0s/2m0s

running (1m40.0s), 25/25 VUs, 7992 complete and 0 interrupted iterations
default   [  83% ] 25 VUs  1m40.0s/2m0s

running (1m41.0s), 25/25 VUs, 8076 complete and 0 interrupted iterations
default   [  84% ] 25 VUs  1m41.0s/2m0s

running (1m42.0s), 25/25 VUs, 8150 complete and 0 interrupted iterations
default   [  85% ] 25 VUs  1m42.0s/2m0s

running (1m43.0s), 25/25 VUs, 8232 complete and 0 interrupted iterations
default   [  86% ] 25 VUs  1m43.0s/2m0s

running (1m44.0s), 25/25 VUs, 8318 complete and 0 interrupted iterations
default   [  87% ] 25 VUs  1m44.0s/2m0s

running (1m45.0s), 25/25 VUs, 8397 complete and 0 interrupted iterations
default   [  87% ] 25 VUs  1m45.0s/2m0s

running (1m46.0s), 25/25 VUs, 8473 complete and 0 interrupted iterations
default   [  88% ] 25 VUs  1m46.0s/2m0s

running (1m47.0s), 25/25 VUs, 8551 complete and 0 interrupted iterations
default   [  89% ] 25 VUs  1m47.0s/2m0s

running (1m48.0s), 25/25 VUs, 8629 complete and 0 interrupted iterations
default   [  90% ] 25 VUs  1m48.0s/2m0s

running (1m49.0s), 25/25 VUs, 8708 complete and 0 interrupted iterations
default   [  91% ] 25 VUs  1m49.0s/2m0s

running (1m50.0s), 25/25 VUs, 8789 complete and 0 interrupted iterations
default   [  92% ] 25 VUs  1m50.0s/2m0s

running (1m51.0s), 25/25 VUs, 8870 complete and 0 interrupted iterations
default   [  92% ] 25 VUs  1m51.0s/2m0s

running (1m52.0s), 25/25 VUs, 8954 complete and 0 interrupted iterations
default   [  93% ] 25 VUs  1m52.0s/2m0s

running (1m53.0s), 25/25 VUs, 9027 complete and 0 interrupted iterations
default   [  94% ] 25 VUs  1m53.0s/2m0s

running (1m54.0s), 25/25 VUs, 9103 complete and 0 interrupted iterations
default   [  95% ] 25 VUs  1m54.0s/2m0s

running (1m55.0s), 25/25 VUs, 9179 complete and 0 interrupted iterations
default   [  96% ] 25 VUs  1m55.0s/2m0s

running (1m56.0s), 25/25 VUs, 9257 complete and 0 interrupted iterations
default   [  97% ] 25 VUs  1m56.0s/2m0s

running (1m57.0s), 25/25 VUs, 9337 complete and 0 interrupted iterations
default   [  97% ] 25 VUs  1m57.0s/2m0s

running (1m58.0s), 25/25 VUs, 9416 complete and 0 interrupted iterations
default   [  98% ] 25 VUs  1m58.0s/2m0s

running (1m59.0s), 25/25 VUs, 9498 complete and 0 interrupted iterations
default   [  99% ] 25 VUs  1m59.0s/2m0s

running (2m00.0s), 25/25 VUs, 9574 complete and 0 interrupted iterations
default   [ 100% ] 25 VUs  2m00.0s/2m0s


  █ THRESHOLDS 

    checks
    ✓ 'rate==1.0' rate=100.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=11.17ms
    ✓ 'p(99)<1000' p(99)=16.31ms

    unexpected_errors
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 30378   252.26201/s
    checks_succeeded...: 100.00% 30378 out of 30378
    checks_failed......: 0.00%   0 out of 30378

    ✓ detail: correct id
    ✓ detail: seeded version
    ✓ approver list: status filter holds
    ✓ approver list: department filter holds
    ✓ approver list: keyword filter holds
    ✓ approver list: page metadata consistent
    ✓ employee list: first page
    ✓ employee list: exactly own 120
    ✓ employee list: only own rows
    ✓ workflow: created DRAFT v0
    ✓ workflow: edited v1
    ✓ workflow: submitted PENDING v2
    ✓ workflow: decided v3
    ✓ workflow: detail shows final state
    ✓ workflow: stale approve is 409 version conflict

    CUSTOM
    expected_conflicts.............: 206    1.710645/s
    unexpected_errors..............: 0.00%  0 out of 17497

    HTTP
    http_req_duration..............: avg=6.6ms    min=2.49ms   med=6.29ms   p(90)=9.66ms   p(95)=11.17ms  p(99)=16.31ms  max=353.89ms
      { expected_response:true }...: avg=6.61ms   min=2.49ms   med=6.31ms   p(90)=9.67ms   p(95)=11.19ms  p(99)=16.25ms  max=353.89ms
    http_req_failed................: 1.17%  206 out of 17498
    http_reqs......................: 17498  145.305176/s

    EXECUTION
    iteration_duration.............: avg=312.98ms min=103.64ms med=311.51ms p(90)=474.38ms p(95)=494.08ms p(99)=519.89ms max=1.03s   
    iterations.....................: 9599   79.711075/s
    vus............................: 25     min=25           max=25
    vus_max........................: 25     min=25           max=25

    NETWORK
    data_received..................: 24 MB  200 kB/s
    data_sent......................: 4.7 MB 39 kB/s



running (2m00.4s), 00/25 VUs, 9599 complete and 0 interrupted iterations
default ✓ [ 100% ] 25 VUs  2m0s